import React from 'react';

const StudentInfo = () => {
  const fullName = 'Ткачук Микита';
  const fieldOfStudy = 'Програмування';
  const certification = 'PCI DSS';
  const certificationExplanation =  `'Ось кілька аргументів, чому треба складати сертифікацію PCI DSS: \n` + 
  `Забезпечення безпеки платіжних карток: Сертифікація PCI DSS допомагає забезпечити безпеку обробки, зберігання та передачі даних платіжних карток. Це включає захист від несанкціонованого доступу, шифрування даних, виявлення інцидентів безпеки та багато іншого. Виконання стандарту допомагає запобігти крадіжкам карткових даних, зловживанню та шахрайствам, що можуть пошкодити як репутацію організації, так і вірогідність втрати клієнтів.\n`+
  `Відповідність вимогам платіжної індустрії: PCI DSS є вимогою платіжної індустрії, що встановлюється міжнародними платіжними брендами, такими як Visa, Mastercard, American Express, Discover і JCB. Багато організацій, які обробляють платежі з використанням карток, повинні відповідати цим вимогам, щоб мати можливість приймати платежі та зберігати карткові дані. Виконання сертифікації PCI DSS є необхідним для збереження відносин з платіжними брендами та партнерами.\n` +
  `Зменшення ризику порушення безпеки даних: Складання сертифікації PCI DSS допомагає організації зменшити ризик порушення безпеки даних. Стандарт вимагає ретельного перегляду систем безпеки, усунення вразливостей, встановлення захисних заходів та регулярного моніторингу. Це дозволяє виявити потенційні загрози та проблеми безпеки до їх активізації. Підходячий захист даних зменшує ризик фінансових втрат, втрати довіри клієнтів та інших негативних наслідків.\n`+
  `Впровадження найкращих практик: Стандарт PCI DSS включає в себе набір найкращих практик у галузі безпеки даних. Складання сертифікації дозволяє організаціям впровадити ці найкращі практики та вдосконалити свої процеси обробки карткових даних. Це включає в себе поліпшення контролю доступу, встановлення систем виявлення інтрузій, оновлення програмного забезпечення та багато іншого. Виконання стандарту допомагає забезпечити безпеку даних та оптимізувати процеси організації.\n`+
  `Узагальнюючи, складання сертифікації PCI DSS є необхідним для забезпечення безпеки обробки карткових даних, відповідності вимогам платіжної індустрії, зменшення ризику порушення безпеки даних та впровадження найкращих практик у галузі безпеки. Це важлива крок для будь-якої організації, яка працює з платіжними картками, оскільки допомагає зберегти довіру клієнтів та уникнути фінансових втрат і наслідків, повязаних з порушенням безпеки даних.`;


  return (
    <div>
      <h1>Студентська інформація</h1>
      <p>Прізвище, ім'я: {fullName}</p>
      <p>Напрямок: {fieldOfStudy}</p>
      <p>Персональна сертифікація: {certification}</p>
      <p>Аргументація, чому саме ця сертифікація:</p>
      <p style={{whiteSpace: 'pre-wrap'}}>{certificationExplanation}</p>
    </div>
  );
};

export default StudentInfo;
